app/controllers/universities_controller.rb

  def GetAllUniversities
    @arrUniversities = University.all
---
SELECT `universities`.* FROM `universities`

  def GetUniversityById
    @oUniv = University.find(params[:nId])
---
SELECT  `universities`.* FROM `universities`  WHERE `universities`.`id` = 1 LIMIT 1

  def GetGroupsByUniversityId
    #puts session[:user_id]
    @arrGroups = Group.where(university_id: params[:nId])
---
SELECT `groups`.* FROM `groups`  WHERE `groups`.`university_id` = 1

  def GetPostsByGroupId
    #@arrPosts = Post.where(group_id: params[:nId])
    @arrPosts = Post.joins(:user)
    .where(posts:{group_id: params[:nId]})
    .select('users.name, posts.*')
---
SELECT users.name, posts.* FROM `posts` INNER JOIN `users` ON `users`.`id` = `posts`.`user_id` WHERE `posts`.`groupId` = '5'

  def AddEditGroup
    if(group_params[:id].nil? || group_params[:id] == -1)
      # Add new group
      newGroup_params = Hash.new
      newGroup_params['user_id'] = session[:user_id]
      newGroup_params['groupName'] = group_params[:groupName]
      newGroup_params['desc'] = group_params[:desc]
      newGroup_params['university_id'] = group_params[:universityId]

      #puts newGroup_params;

      #puts "HIiiiii"
      @group = Group.new(newGroup_params)
      if @group.save
---
INSERT INTO `groups` (`created_at`, `desc`, `groupName`, `university_id`, `updated_at`, `user_id`) VALUES ('2016-12-08 22:19:45', 'group dis', 'Group 1', 3, '2016-12-08 22:19:45', 5)

  def AddEditPost
    if(post_params[:id].nil? || post_params[:id] == -1)
      # Add new post
      newPost_params = Hash.new
      newPost_params['user_id'] = session[:user_id]
      newPost_params['group_id'] = post_params[:groupId]
      newPost_params['postData'] = post_params[:postData]
      newPost_params['like'] = post_params[:like]
      newPost_params['dislike'] = post_params[:dislike]
      puts newPost_params
      @post = Post.new(newPost_params)
      if @post.save
---
INSERT INTO `posts` (`created_at`, `group_id`, `postData`, `updated_at`, `user_id`) VALUES ('2016-12-08 22:13:30', 1, 'Comment by a', '2016-12-08 22:13:30', 5)

  def AddEditCommentToPost
    if(comment_params[:id].nil? || comment_params[:id] == -1)
      # Add new comment
      newComment_params = Hash.new
      newComment_params['user_id'] = session[:user_id]
      newComment_params['post_id'] = comment_params[:postId]
      newComment_params['commentData'] = comment_params[:commentData]
      newComment_params['like'] = comment_params[:like]
      newComment_params['dislike'] = comment_params[:dislike]

      @comment = Comment.new(newComment_params)
      if @comment.save
---
INSERT INTO `comments` (`commentData`, `created_at`, `post_id`, `updated_at`, `user_id`) VALUES ('It\'s good.', '2016-12-08 23:15:57', 1, '2016-12-08 23:15:57', 4)

  def Filter
    print "Print params.....................",  params
    #defaulting rank low to 1 and high to unrealistic value 10000
    if params[:filter][:rank][:low] == nil || params[:filter][:rank][:low] == ""
      params[:filter][:rank][:low] = "1"
    end
    if params[:filter][:rank][:high] == nil || params[:filter][:rank][:high] == ""
      params[:filter][:rank][:high] = "10000"
    end

    #Defaulting low fee to 0 and high fee to unrealistic value
    if params[:filter][:fees][:low] == nil || params[:filter][:fees][:low] == ""
      params[:filter][:fees][:low] = "0"
    end
    if params[:filter][:fees][:high] == nil || params[:filter][:fees][:high] == ""
      params[:filter][:fees][:high] = "9999999"
    end

    states = params[:filter][:states]
    if states == nil || states == []
      states = ["NJ", "MA", "IL", "CT", "NY", "CA", "NC", "PA", "MD", "NH", "RI", "TX", "IN", "TN", "MO", "GA", " :dC"]
    end
    rank_range = params[:filter][:rank][:low]..params[:filter][:rank][:high]
    fees_range = params[:filter][:fees][:low]..params[:filter][:fees][:high]

    @arrUniversities = University.where(rank: rank_range,arrTuition: fees_range,state: states)
---
SELECT `universities`.* FROM `universities`  WHERE (`universities`.`rank` BETWEEN 2 AND 10) AND (`universities`.`arrTuition` BETWEEN 0 AND 9999999) AND `universities`.`state` IN ('NJ', 'MA', 'IL', 'CT', 'NY', 'CA', 'NC', 'PA', 'MD', 'NH', 'RI', 'TX', 'IN', 'TN', 'MO', 'GA', ' :dC')