app/controllers/universities_controller.rb

SELECT `posts`.* FROM `posts`  WHERE `posts`.`group_id` = 1
---
  def GetPostsByGroupId
    @arrPosts = Post.where(group_id: params[:nId])

SELECT `comments`.* FROM `comments`  WHERE `comments`.`post_id` = 1
---
  def GetCommentsByPostId
    @arrComments = Comment.where(post_id: params[:nId])