app/controllers/users_controller.rb

  def LoginUser
    #puts userlogin_params[:email]
    user = User.find_by(email: userlogin_params[:email])
---
SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'haim@gmail.com' LIMIT 1

  def AddUser
    #print user_params
    user = User.find_by(email: user_params[:email])
    if user
      render :json => { status: false, msg: "Username is already in user"}
    else
      @user = User.new(user_params)
      if @user.save
---
SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'suhas@gmail.com' LIMIT 1
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Kalyan', 'kalyan@gmail.com', '$2a$10$fJomTJ0P9YwCQKafEDhFw.ZOG3ULZE/etCsLHID7gUbYI4m.WSm7u', '2016-12-09 04:30:31', '2016-12-09 04:30:31')